Revit 2024 API
HandRail Class
 Represents a hand rail element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class HandRail : ContinuousRail
Visual Basic
Public Class HandRail _
	Inherits ContinuousRail
Visual C++
public ref class HandRail : public ContinuousRail
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.ContinuousRail
 Autodesk.Revit.DB.Architecture.HandRail
See Also
HandRail Members
Autodesk.Revit.DB.Architecture Namespace